#!/bin/bash
# =========================== НАЗНАЧЕНИЕ ===========================
# Запуск длительного процесса по nohup: запущенные утилиты будут 
# продолжать свое выполнение даже после закрытия терминала
# ==================================================================
# 
# ============================ КОМАНДЫ =============================
# nohup ping google.com & - запуск утилиты ping по nohup
# ps aux - вывод всех действующих процессов с дополнительной 
# информацией
# ==================================================================
# 

# запускаем утилиту ping без привязки к сигналу SIGHUP
nohup ping google.com &
ps aux | ping